zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_atim.c
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_atim.c
  * @author  FMSH Application Team
  * @brief   Source file of ATIM FL Module
  *******************************************************************************************************  
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33fg0xxa_fl.h"

/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */

/** @addtogroup ATIM
  * @{
  */

#ifdef FL_ATIM_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup ATIM_FL_Private_Macros
  * @{
  */


#define IS_ATIM_INSTANCE(TIMx)                         ((TIMx) == ATIM)

#define IS_ATIM_CLKSRC(__VALUE__)                      (   ((__VALUE__) == FL_CMU_ATIM_CLK_SOURCE_APBCLK)\
                                                        || ((__VALUE__) == FL_CMU_ATIM_CLK_SOURCE_PLL_X2))


#define IS_FL_ATIM_COUNTERMODE(__VALUE__)              (   ((__VALUE__) == FL_ATIM_COUNTER_DIR_UP)\
                                                        || ((__VALUE__) == FL_ATIM_COUNTER_DIR_DOWN)\
                                                        || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN)\
                                                        || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP)\
                                                        || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN))

#define IS_FL_ATIM_CLOCKDIVISION(__VALUE__)            (   ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV1)\
                                                        || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV2)\
                                                        || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV4))


#define IS_FL_ATIM_CC_MODE(__VALUE__)                  (   ((__VALUE__) == FL_ATIM_CHANNEL_MODE_OUTPUT)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_NORMAL)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_TRC))

#define IS_FL_ATIM_IC_FILTER(__VALUE__)                (   ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1 )\
                                                        || ((__VALUE__) ==FL_ATIM_IC_FILTER_DIV1_N2)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N4)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N8)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N6)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N8)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N6)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N8)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N6)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N8)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N5)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N6)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N8)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N5)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N6)\
                                                        || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N8))

