zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_atim.c
#define IS_FL_ATIM_CHANNEL(__VALUE__)                  (   ((__VALUE__) == FL_ATIM_CHANNEL_1)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_2)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_3)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_4))



#define IS_FL_ATIM_SLAVE_MODE(__VALUE__)               (   ((__VALUE__) == FL_ATIM_SLAVE_MODE_PROHIBITED)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X2_TI1)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X2_TI2)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X4_TI1TI2)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RST)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RUN)\
                                                        || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_CLK))


#define IS_FL_ATIM_TRIGGER_SRC(__VALUE__)              (   ((__VALUE__) == FL_ATIM_TRGI_ITR0 )\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_ITR1 )\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_ITR2)\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_ITR3)\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_TI1F_EDGE)\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_TI1FP1)\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_TI2FP2)\
                                                        || ((__VALUE__) == FL_ATIM_TRGI_ETRF))



#define IS_FL_ATIM_ETP_FILTER(__VALUE__)               (   ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N2)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N4)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N8)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N6)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N8)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N6)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N8)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N6)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N8)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N5)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N6)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N8)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N5)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N6)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N8))


#define IS_FL_ATIM_ETR_PSC(__VALUE__)                  (   ((__VALUE__) == FL_ATIM_ETR_PSC_DIV1)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV2)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV4)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_PSC_DIV8))



#define IS_FL_ATIM_ETR_POLARITY(__VALUE__)             (   ((__VALUE__) == FL_ATIM_ETR_POLARITY_NORMAL)\
                                                        || ((__VALUE__) == FL_ATIM_ETR_POLARITY_INVERT))



#define IS_FL_ATIM_IC_POLARITY(__VALUE__)              (   ((__VALUE__) == FL_ATIM_IC_POLARITY_NORMAL)\
                                                        || ((__VALUE__) == FL_ATIM_IC_POLARITY_INVERT))



#define IS_FL_ATIM_IC_ACTIVEINPUT(__VALUE__)           (   ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_NORMAL)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER)\
                                                        || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_TRC))


#define IS_FL_ATIM_IC_PRESCALER(__VALUE__)             (   ((__VALUE__) == FL_ATIM_IC_PSC_DIV1)\
                                                        || ((__VALUE__) == FL_ATIM_IC_PSC_DIV2)\
                                                        || ((__VALUE__) == FL_ATIM_IC_PSC_DIV4)\
                                                        || ((__VALUE__) == FL_ATIM_IC_PSC_DIV8))



#define IS_FL_ATIM_OC_POLARITY(__VALUE__)              (   ((__VALUE__) == FL_ATIM_OC_POLARITY_NORMAL)\
                                                        || ((__VALUE__) == FL_ATIM_OC_POLARITY_INVERT))



#define IS_FL_ATIM_OC_MODE(__VALUE__)                  (   ((__VALUE__) == FL_ATIM_OC_MODE_FROZEN)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_ACTIVE)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_INACTIVE)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_TOGGLE)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_FORCED_INACTIVE)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_FORCED_ACTIVE)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_PWM1)\
                                                        || ((__VALUE__) == FL_ATIM_OC_MODE_PWM2))

#define IS_FL_ATIM_AUTORELOAB_STATE(__VALUE__)         (   ((__VALUE__) == FL_ENABLE)\
                                                        || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_FASTMODE(__VALUE__)              (   ((__VALUE__) == FL_ENABLE)\
                                                        || ((__VALUE__) == FL_DISABLE))

#define IS_FL_ATIM_OC_PRELOAD(__VALUE__)               (   ((__VALUE__) == FL_ENABLE)\
                                                        || ((__VALUE__) == FL_DISABLE))

